{
    "<unk>": 0,
    "<pad>": 1,
    "<start>": 2,
    "<end>": 3,
    "nan": 4,
    "create": 5,
    "string": 6,
    "s": 7,
    "integers": 8,
    "x1": 9,
    ",": 10,
    "y1": 11,
    "x2": 12,
    "y2": 13,
    "read": 14,
    "set": 15,
    "to": 16,
    "[": 17,
    "0": 18,
    "]": 19,
    "-": 20,
    "96": 21,
    "1": 22,
    "'0": 23,
    "'": 24,
    "print": 25,
    "maximum": 26,
    "of": 27,
    "absolute": 28,
    "value": 29,
    "and": 30,
    "newline": 31,
    "while": 32,
    "is": 33,
    "not": 34,
    "or": 35,
    "if": 36,
    "greater": 37,
    "than": 38,
    "``": 39,
    "R": 40,
    "''": 41,
    "increment": 42,
    "less": 43,
    "L": 44,
    "decrement": 45,
    "D": 46,
    "U": 47,
    "\\n": 48,
    "=": 49,
    "Read": 50,
    "(": 51,
    ")": 52,
    "!": 53,
    "OR": 54,
    "TRUE": 55,
    "do": 56,
    "the": 57,
    "following": 58,
    "a": 59,
    "new": 60,
    "line": 61,
    "character": 62,
    "array": 63,
    "c1": 64,
    "size": 65,
    "2": 66,
    "c2": 67,
    "vector": 68,
    "ans": 69,
    "add": 70,
    "element": 71,
    "RU": 72,
    "end": 73,
    "else": 74,
    "RD": 75,
    "LD": 76,
    "LU": 77,
    "for": 78,
    "i": 79,
    "exclusive": 80,
    "let": 81,
    "be": 82,
    "an": 83,
    "characters": 84,
    "length": 85,
    "strings": 86,
    "||": 87,
    "<": 88,
    "&": 89,
    "push": 90,
    "into": 91,
    "increase": 92,
    "by": 93,
    "one": 94,
    ">": 95,
    "decrease": 96,
    "all": 97,
    "elements": 98,
    "with": 99,
    "after": 100,
    "each": 101,
    "n": 102,
    "m": 103,
    "long": 104,
    "x": 105,
    "y": 106,
    "b": 107,
    "s1": 108,
    "int": 109,
    "-n": 110,
    "-m": 111,
    "bitwise": 112,
    "invert": 113,
    "sign": 114,
    "'R": 115,
    "'L": 116,
    "'U": 117,
    "'D": 118,
    "max": 119,
    "now": 120,
    "goal": 121,
    "way": 122,
    "100": 123,
    "step": 124,
    "tstep": 125,
    "-step": 126,
    ".": 127,
    "equal": 128,
    "'RD": 129,
    "'LD": 130,
    "'RU": 131,
    "'LU": 132,
    "S": 133,
    "49": 134,
    "97": 135,
    "Way": 136,
    "integer": 137,
    "counter": 138,
    "true": 139,
    "sign_X": 140,
    "/": 141,
    "sigh_Y": 142,
    "sign_Y": 143,
    "-1": 144,
    "break": 145,
    "loop": 146,
    "'\\n": 147,
    "empty": 148,
    "WAY": 149,
    "abs": 150,
    "otherwise": 151,
    "append": 152,
    "are": 153,
    "both": 154,
    "10": 155,
    "2d": 156,
    "csx": 157,
    "ctx": 158,
    "sx": 159,
    "sy": 160,
    "tx": 161,
    "ty": 162,
    "k": 163,
    "6": 164,
    "8": 165,
    "3": 166,
    "5": 167,
    "k-th": 168,
    "4": 169,
    "7": 170,
    "inclusive": 171,
    "declare": 172,
    "res": 173,
    "as": 174,
    "arguments": 175,
    "returning": 176,
    "return": 177,
    "from": 178,
    "function": 179,
    "xy": 180,
    "wtih": 181,
    "j": 182,
    "l": 183,
    "count": 184,
    "vec": 185,
    "result": 186,
    "run": 187,
    "that": 188,
    "returns": 189,
    "char": 190,
    "assign": 191,
    "called": 192,
    "aa": 193,
    "bb": 194,
    "values": 195,
    "creat": 196,
    "t": 197,
    "+": 198,
    "+1": 199,
    "define": 200,
    "symbol": 201,
    "d": 202,
    "short": 203,
    "'a": 204,
    "ints": 205,
    "d1": 206,
    "d2": 207,
    "min": 208,
    "minimum": 209,
    "casted": 210,
    "variable": 211,
    "inp": 212,
    ";": 213,
    "64": 214,
    "c": 215,
    "at": 216,
    "index": 217,
    "r": 218,
    "ctr": 219,
    "dr": 220,
    "dc": 221,
    "vectors": 222,
    "VI": 223,
    "VI2": 224,
    "VI3": 225,
    "VI4": 226,
    "f": 227,
    "RU\\n": 228,
    "RD\\n": 229,
    "LU\\n": 230,
    "LD\\n": 231,
    "U\\n": 232,
    "D\\n": 233,
    "R\\n": 234,
    "L\\n": 235,
    "arrays": 236,
    "xx": 237,
    "yy": 238,
    "y1-y2": 239,
    "start": 240,
    "endless": 241,
    "s2": 242,
    "c_x": 243,
    "c_y": 244,
    "d_y": 245,
    "d_x": 246,
    "-y": 247,
    "get": 248,
    "open": 249,
    "file": 250,
    "cp.inp": 251,
    "reading": 252,
    "cp.out": 253,
    "writing": 254,
    "CP.inp": 255,
    "mode": 256,
    "using": 257,
    "stream": 258,
    "stdin": 259,
    "CP.out": 260,
    "w": 261,
    "stdout": 262,
    "reference": 263,
    "in": 264,
    "t1": 265,
    "t2": 266,
    "q": 267,
    "v": 268,
    "z": 269,
    "u": 270,
    "G": 271,
    "minimal": 272,
    "sum": 273,
    "times": 274,
    "current": 275,
    "destination": 276,
    "input": 277,
    "udmoves": 278,
    "rlmoves": 279,
    "aboslute": 280,
    "o": 281,
    "p": 282,
    "multiply": 283,
    "longs": 284,
    "*": 285,
    "n1": 286,
    "n2": 287,
    "startx": 288,
    "starty": 289,
    "endx": 290,
    "endy": 291,
    "'1": 292,
    "starx": 293,
    "variables": 294,
    "type": 295,
    "i-th": 296,
    "d=": 297,
    "k=": 298,
    "dest": 299,
    "letter_start": 300,
    "letter_start=start": 301,
    "letter_dest": 302,
    "num_start": 303,
    "num_dest": 304,
    "v1": 305,
    "v2": 306,
    "v1+v2-minimum": 307,
    "i1": 308,
    "i2": 309,
    "l1": 310,
    "l2": 311,
    "-'a": 312,
    "-'1": 313,
    "str": 314,
    "1000": 315,
    "y1=": 316,
    "subtract": 317,
    "cx": 318,
    "cy": 319,
    "dx": 320,
    "dy": 321,
    "48": 322,
    "xd": 323,
    "yd": 324,
    "decrementing": 325,
    "can": 326,
    "mx": 327,
    "-s2": 328,
    "rx": 329,
    "ry": 330,
    "xf": 331,
    "yf": 332,
    "kol": 333,
    "==": 334,
    "{": 335,
    "}": 336,
    "xie": 337,
    "r1": 338,
    "r2": 339,
    "=integers": 340,
    "=string": 341,
    "1001": 342,
    "cnt": 343,
    "content": 344,
    "indices": 345,
    "through": 346,
    "xs": 347,
    "ys": 348,
    "xt": 349,
    "yt": 350,
    "200": 351,
    "yet": 352,
    "yes": 353,
    "p1": 354,
    "p2": 355,
    "chars": 356,
    "pointers": 357,
    "lesser": 358,
    "--": 359,
    "inline": 360,
    "no": 361,
    "ch": 362,
    "digit": 363,
    "'-": 364,
    "bitshift": 365,
    "left": 366,
    "fx": 367,
    "fy": 368,
    "incremented": 369,
    "whitespace": 370,
    "getchar": 371,
    "inccrement": 372,
    "gap": 373,
    "terminated": 374,
    "discard": 375,
    "hi2": 376,
    "then": 377,
    "ex": 378,
    "ey": 379,
    "flag1": 380,
    "flag2": 381,
    "fabs": 382,
    "ex-sx": 383,
    "ey-sy": 384,
    "argument": 385,
    "on": 386,
    "every": 387,
    "iteration": 388,
    "diag": 389,
    "diag2": 390,
    "i1-l1": 391,
    "getint": 392,
    "'9": 393,
    "-a": 394,
    "excluisve": 395,
    "absoluve": 396,
    "integet": 397,
    "truthy": 398,
    "more": 399,
    "reduce": 400,
    "lessen": 401,
    "fastIo": 402,
    "invoke": 403,
    "MAT": 404,
    "LC": 405,
    "RC": 406,
    "TR": 407,
    "BR": 408,
    "boolean": 409,
    "first": 410,
    "false": 411,
    "'*": 412,
    "min_i": 413,
    "min_j": 414,
    "max_i": 415,
    "max_j": 416,
    "51": 417,
    "55": 418,
    "check": 419,
    "mn": 420,
    "888888": 421,
    "m1": 422,
    "m2": 423,
    "444": 424,
    "ar": 425,
    "uper": 426,
    "lowar": 427,
    "right": 428,
    "ck": 429,
    "con": 430,
    "h1": 431,
    "stop": 432,
    "h2": 433,
    "until": 434,
    "2e9": 435,
    "66": 436,
    "6666": 437,
    "finishx": 438,
    "finishy": 439,
    "startx=55": 440,
    "starty=55": 441,
    "st": 442,
    "90": 443,
    "hangx": 444,
    "4409": 445,
    "coty": 446,
    "4999": 447,
    "tt": 448,
    "xaydung": 449,
    "hang": 450,
    "cot": 451,
    "void": 452,
    "bao1": 453,
    "bao2": 454,
    "demx": 455,
    "demy": 456,
    "maxx": 457,
    "col": 458,
    "tt-1": 459,
    "sort": 460,
    "chodoi": 461,
    "call": 462,
    "-100": 463,
    "A": 464,
    "xmin": 465,
    "xmax": 466,
    "ymin": 467,
    "ymax": 468,
    "mat": 469,
    "e": 470,
    "counting": 471,
    "down": 472,
    "50": 473,
    "substring": 474,
    "arr": 475,
    "up": 476,
    "mni": 477,
    "mnj": 478,
    "mxi": 479,
    "mxj": 480,
    "INT_MAX": 481,
    "miny": 482,
    "maxy": 483,
    "minx": 484,
    "ch1": 485,
    "ch2": 486,
    "ch3": 487,
    "ch4": 488,
    "x0": 489,
    "y0": 490,
    "go": 491,
    "jump": 492,
    "point": 493,
    "=n": 494,
    "label": 495,
    "lx": 496,
    "ly": 497,
    "constant": 498,
    "MOD": 499,
    "1000000007": 500,
    "INF": 501,
    "INF2": 502,
    "1000000007LL": 503,
    "double": 504,
    "EPS": 505,
    "1e-9": 506,
    "minj": 507,
    "maxi": 508,
    "maxj": 509,
    "-INF": 510,
    "mini": 511,
    "a1": 512,
    "a2": 513,
    "a3": 514,
    "a4": 515,
    "lett": 516,
    "errl": 517,
    "err": 518,
    "alt": 519,
    "ust": 520,
    "sag": 521,
    "sol": 522,
    "-1000": 523,
    "incluisive": 524,
    "60": 525,
    "500": 526,
    "endj": 527,
    "incrementing": 528,
    "endi": 529,
    "99999999": 530,
    "101": 531,
    "lu": 532,
    "ru": 533,
    "ld": 534,
    "rd": 535,
    "100000": 536,
    "hi": 537,
    "hj": 538,
    "li": 539,
    "lj": 540,
    "flag": 541,
    "gg": 542,
    "0x3f": 543,
    "m3": 544,
    "m4": 545,
    "map": 546,
    "booleans": 547,
    "g": 548,
    "52": 549,
    "X": 550,
    "Y": 551,
    "999999": 552,
    "ok": 553,
    "999": 554,
    "mini1": 555,
    "mini2": 556,
    "maxi1": 557,
    "maxi2": 558,
    "imx": 559,
    "imn": 560,
    "jmx": 561,
    "jmn": 562,
    "1222": 563,
    "-2019": 564,
    "MX": 565,
    "1e4": 566,
    "continue": 567,
    "arr1": 568,
    "imin": 569,
    "imax": 570,
    "jmin": 571,
    "jmax": 572,
    "imex": 573,
    "row_min": 574,
    "row_max": 575,
    "9": 576,
    "11": 577,
    "fill": 578,
    "%": 579,
    "i=": 580,
    "34298343": 581,
    "2193809": 582,
    "data": 583,
    "initialized": 584,
    "craete": 585,
    "row": 586,
    "graph": 587,
    "start_x": 588,
    "start_y": 589,
    "end_x": 590,
    "end_y": 591,
    "Min_X": 592,
    "Min_Y": 593,
    "Max_X": 594,
    "Max_Y": 595,
    "**sheet": 596,
    "minRow": 597,
    "minCol": 598,
    "maxRow": 599,
    "maxCol": 600,
    "sheet": 601,
    "pointer": 602,
    "**shap": 603,
    "shap": 604,
    "newchar": 605,
    "rows": 606,
    "colums": 607,
    "rowe": 608,
    "colume": 609,
    "user": 610,
    "change": 611,
    "name": 612,
    "standard": 613,
    "output": 614,
    "N": 615,
    "123": 616,
    "1e9": 617,
    "KIOT_camp": 618,
    "x3": 619,
    "y3": 620,
    "x4": 621,
    "y4": 622,
    "exit": 623,
    "m=int": 624,
    "s=vector": 625,
    "checktop": 626,
    "args": 627,
    "i=0": 628,
    "j=0": 629,
    "checkbottom": 630,
    "i=n-1": 631,
    "checkleft": 632,
    "checkright": 633,
    "i=m-1": 634,
    "resize": 635,
    "left=checkleft": 636,
    "right=checkright": 637,
    "top=checktop": 638,
    "bottom=checkbottom": 639,
    "i=top": 640,
    "bottom": 641,
    "starting": 642,
    "len": 643,
    "right-left+1": 644,
    "n-1": 645,
    "m-1": 646,
    "flag=0": 647,
    "i=u": 648,
    "j=l": 649,
    "#": 650,
    "modulo": 651,
    "odd": 652,
    "where": 653,
    "'\\0": 654,
    "bitwise-and": 655,
    "multiple": 656,
    "even": 657,
    ".\\n": 658,
    "const": 659,
    "maxn": 660,
    "200000": 661,
    "zw": 662,
    "make": 663,
    "pair": 664,
    "30": 665,
    "ss": 666,
    "sss": 667,
    "falsy": 668,
    "temp": 669,
    "uneven": 670,
    "=1": 671,
    "adding": 672,
    "further": 673,
    "1e5": 674,
    "nn": 675,
    "305": 676,
    "method": 677,
    "different": 678,
    "flg": 679,
    "=0": 680,
    "lie": 681,
    "skip": 682,
    "rest": 683,
    "filled": 684,
    "changing": 685,
    "increasing": 686,
    "setting": 687,
    "printing": 688,
    "rem": 689,
    "v3": 690,
    "make_pair": 691,
    "se": 692,
    "h": 693,
    "mod": 694,
    "pritn": 695,
    "n't": 696,
    "reset": 697,
    "i=1": 698,
    "m=": 699,
    "i=i+2": 700,
    "exclusivem": 701,
    "i+1": 702,
    "endline": 703,
    "fastio": 704,
    "m=long": 705,
    "120": 706,
    "2000010": 707,
    "taking": 708,
    "mul": 709,
    "1LL": 710,
    "?": 711,
    ":": 712,
    "10000": 713,
    "isitright": 714,
    "j=1": 715,
    "s=0": 716,
    "a-1": 717,
    "v=0": 718,
    "b-1": 719,
    "n/2": 720,
    "l=0": 721,
    "k=1": 722,
    "k=2": 723,
    "1.exclusive": 724,
    "bool": 725,
    "col-1": 726,
    "j=m": 727,
    "20": 728,
    "but": 729,
    "last": 730,
    "equals": 731,
    "power": 732,
    "modi": 733,
    "res=1": 734,
    "res=": 735,
    "res*a": 736,
    "divide": 737,
    "a=": 738,
    "a*a": 739,
    "dirx=array": 740,
    "-1,0,0,1,1,1": 741,
    "diry=array": 742,
    "-1,0,1": 743,
    "-1,1": 744,
    "dx=array": 745,
    "-1,1,0,0": 746,
    "dy=array": 747,
    "0,0": 748,
    "y=int": 749,
    "cur=0": 750,
    "c=int": 751,
    "a=array": 752,
    "1005": 753,
    "r=string": 754,
    "c=0": 755,
    "decremented": 756,
    "column": 757,
    "s3": 758,
    "columns": 759,
    "**p": 760,
    "assigning": 761,
    "TESTS": 762,
    "j=m-1": 763,
    "ma": 764,
    "iterate": 765,
    "lol": 766,
    "flag=1": 767,
    "rtr": 768,
    "4=0": 769,
    "num": 770,
    "o=true": 771,
    "o=false": 772,
    "j=int": 773,
    "part": 774,
    "c=1": 775,
    "flag=false": 776,
    "flag=true": 777,
    "mxn": 778,
    "sizeof": 779,
    "bytes": 780,
    "i/2": 781,
    "event": 782,
    "check=1": 783,
    "check=0": 784,
    "statement": 785,
    "mk": 786,
    "which": 787,
    "takes": 788,
    "i*i": 789,
    "evenly": 790,
    "divisible": 791,
    "1000005": 792,
    "intergers": 793,
    "YES": 794,
    "NO": 795,
    "l+1+i": 796,
    "YES\\n": 797,
    "NO\\n": 798,
    "SZ": 799,
    "1003": 800,
    "isprime": 801,
    "sieve": 802,
    "iprime": 803,
    "primes": 804,
    "isPrime": 805,
    "ji": 806,
    "prime": 807,
    "j+1": 808,
    "ifprime": 809,
    "squared": 810,
    "divides": 811,
    "without": 812,
    "remainder": 813,
    "good": 814,
    "3000": 815,
    "i+last+1": 816,
    "falst": 817,
    "sq": 818,
    "ceil": 819,
    "square": 820,
    "root": 821,
    "1005+0.0": 822,
    "prn": 823,
    "pr": 824,
    "j*j": 825,
    "next": 826,
    "primos": 827,
    "esPrimo": 828,
    "primo": 829,
    "n+1": 830,
    "1111": 831,
    "plen": 832,
    "incresing": 833,
    "last+i+1": 834,
    "i-1": 835,
    "bitset": 836,
    "was": 837,
    "100010": 838,
    "bits": 839,
    "bit": 840,
    "sqrt": 841,
    "fase": 842,
    "a^2": 843,
    "divided": 844,
    "defined": 845,
    "1010": 846,
    "visit": 847,
    "++*p": 848,
    "*p": 849,
    "MAXN": 850,
    "pd": 851,
    "find_prime": 852,
    "find": 853,
    "mid": 854,
    "mz": 855,
    "pos": 856,
    "i*prime": 857,
    "tmp": 858,
    "ju": 859,
    "insert": 860,
    "iterator": 861,
    "it": 862,
    "beginning": 863,
    "1,1": 864,
    "2002": 865,
    "puts": 866,
    "isp": 867,
    "Primes": 868,
    "20000": 869,
    "fin": 870,
    "30000": 871,
    "seive": 872,
    "exists": 873,
    "prevI": 874,
    "2000": 875,
    "memset": 876,
    "test": 877,
    "File": 878,
    "output.txt": 879,
    "input.txt": 880,
    "fast": 881,
    "pi": 882,
    "3.1415926": 883,
    "1e3": 884,
    "solve": 885,
    "address": 886,
    "is_prime": 887,
    "mark": 888,
    "nextPrime": 889,
    "noldbach": 890,
    "nextPrimeNum": 891,
    "error": 892,
    "arrar": 893,
    "pri": 894,
    "168": 895,
    "increments": 896,
    "1000+10": 897,
    "*i": 898,
    "cin": 899,
    "4000": 900,
    "binary_search": 901,
    "1009": 902,
    "incremement": 903,
    "+prime": 904,
    "i-2": 905,
    "zero": 906,
    "sievesize": 907,
    "bs": 908,
    "600": 909,
    "putprime": 910,
    "isNoldPrime": 911,
    "*2": 912,
    "returned": 913,
    "peimrs": 914,
    "=x": 915,
    "judge": 916,
    "ii": 917,
    "tp": 918,
    "cm": 919,
    "lt": 920,
    "has": 921,
    "assigned": 922,
    "flush": 923,
    "condition": 924,
    "met": 925,
    "so": 926,
    "pp": 927,
    "2222": 928,
    "pm": 929,
    "modulus": 930,
    "pm2": 931,
    "i+j+1": 932,
    "pv": 933,
    "oolean": 934,
    "lt+i+1": 935,
    "os": 936,
    "100001": 937,
    "1000010": 938,
    "phi": 939,
    "primesize": 940,
    "register": 941,
    "isdigit": 942,
    "getlist": 943,
    "listsize": 944,
    "pre": 945,
    "init": 946,
    "+=": 947,
    "get_prime": 948,
    "*it": 949,
    "instance": 950,
    "w=": 951,
    "euql": 952,
    "86": 953,
    "steps": 954,
    "cnd": 955,
    "87": 956,
    "rounded": 957,
    "book": 958,
    "is_p": 959,
    "Seive": 960,
    "CalculatePrimes": 961,
    "limit": 962,
    "sums": 963,
    "primes.size": 964,
    "sums.push_back": 965,
    "sums.size": 966,
    "primes.begin": 967,
    "primes.end": 968,
    "inf": 969,
    "1e18": 970,
    "x=int": 971,
    "y=x/2": 972,
    "z=0": 973,
    "x-2*y": 974,
    "y=0": 975,
    "y=1": 976,
    "x/2": 977,
    "cont": 978,
    "star": 979,
    "display": 980,
    "tmp/2": 981,
    "dCount": 982,
    "starCount": 983,
    "decreasing": 984,
    "mf": 985,
    "tr": 986,
    "max_n": 987,
    "show": 988,
    "float": 989,
    "draw": 990,
    "202": 991,
    "201": 992,
    "2==0||n": 993,
    "Mid": 994,
    "DiamondCount": 995,
    "c=array": 996,
    "110": 997,
    "r=int": 998,
    "='*": 999,
    "n/2+1": 1000,
    "='D": 1001,
    "=l": 1002,
    "keep": 1003,
    "going": 1004,
    "doubles": 1005,
    "301": 1006,
    "numD": 1007,
    "numStar": 1008,
    "kkk": 1009,
    "a.first": 1010,
    "b.first": 1011,
    "a.second": 1012,
    "b.second": 1013,
    "inc": 1014,
    "iskom": 1015,
    "k1": 1016,
    "dem": 1017,
    "MD": 1018,
    "1000000009": 1019,
    "2e3": 1020,
    "33": 1021,
    "n=int": 1022,
    "s=array": 1023,
    "n/2-i": 1024,
    "j=n/2+1": 1025,
    "n-j-1": 1026,
    "i=n/2+1": 1027,
    "n-i-1": 1028,
    "sized": 1029,
    "matrix": 1030,
    "/2": 1031,
    "n/2-1": 1032,
    "write": 1033,
    "M": 1034,
    "K": 1035,
    "H": 1036,
    "W": 1037,
    "1000x1000": 1038,
    "forij": 1039,
    "key": 1040,
    "modpow": 1041,
    "u=modpow": 1042,
    "u=": 1043,
    "u*u": 1044,
    "u*x": 1045,
    "k=int": 1046,
    "tt=0": 1047,
    "e=0": 1048,
    "p=0": 1049,
    "n-k": 1050,
    "tt=1": 1051,
    "minus": 1052,
    "table": 1053,
    "half": 1054,
    "exlclusive": 1055,
    "102": 1056,
    "Size": 1057,
    "nothing": 1058,
    "i-n/2": 1059,
    "+abs": 1060,
    "j-n/2": 1061,
    "printDiamond": 1062,
    "diamond": 1063,
    "dotNum": 1064,
    "plus": 1065,
    "between": 1066,
    "m-i": 1067,
    "m+i": 1068,
    "abort": 1069,
    "program": 1070,
    "md": 1071,
    "endl": 1072,
    "sz": 1073,
    "s4": 1074,
    "s5": 1075,
    "s6": 1076,
    "ar2": 1077,
    "brainfuck": 1078,
    "=int": 1079,
    "n-i*2-1": 1080,
    "i*2+1": 1081,
    "n-i2*2-1": 1082,
    "i2*2+1": 1083,
    "icrement": 1084,
    "stars": 1085,
    "ds": 1086,
    "mp": 1087,
    "n-": 1088,
    "2*i+1": 1089,
    "x=0": 1090,
    "o=0": 1091,
    "i=n-2-1": 1092,
    "i+2": 1093,
    "n-i/2": 1094,
    "i=n-2": 1095,
    "n+i/2": 1096,
    "2.0": 1097,
    "accepts": 1098,
    "x-i": 1099,
    "x+i": 1100,
    "od": 1101,
    "boost": 1102,
    "Vector": 1103,
    "star_count": 1104,
    "d_count": 1105,
    "back": 1106,
    "looping": 1107,
    "nprint": 1108,
    "0x3f3f3f3f": 1109,
    "nd": 1110,
    "ns": 1111,
    "out": 1112,
    "t3": 1113,
    "j-1": 1114,
    "arr2": 1115,
    "colom": 1116,
    "toggle": 1117,
    "number": 1118,
    "input=array": 1119,
    "=input": 1120,
    "containing": 1121,
    "Assign": 1122,
    "2e5": 1123,
    "off_or_on": 1124,
    "bin": 1125,
    "two": 1126,
    "dimensional": 1127,
    "sizes": 1128,
    "light": 1129,
    "C": 1130,
    "n_i": 1131,
    "n_j": 1132,
    "dimensions": 1133,
    "pole": 1134,
    "naj": 1135,
    "iii": 1136,
    "ii+1": 1137,
    "ii-1": 1138,
    "isvalid": 1139,
    "curr": 1140,
    "actions": 1141,
    "AND": 1142,
    "NOT": 1143,
    "cpy": 1144,
    "lights": 1145,
    "off": 1146,
    "j1": 1147,
    "press": 1148,
    "ar1": 1149,
    "contents": 1150,
    "width": 1151,
    "11111": 1152,
    "jj": 1153,
    "remove": 1154,
    "imprimir": 1155,
    "encender": 1156,
    "aux": 1157,
    "TOOG": 1158,
    "_i": 1159,
    "ni": 1160,
    "nj=": 1161,
    "_j": 1162,
    "nj": 1163,
    "*a": 1164,
    "*a=0": 1165,
    "*a=1": 1166,
    "isval": 1167,
    "0\\n": 1168,
    "1\\n": 1169,
    "grid": 1170,
    "ar=array": 1171,
    "x=long": 1172,
    "=1-ar": 1173,
    "modd": 1174,
    "-1LL": 1175,
    "dir": 1176,
    "arr=array": 1177,
    "=fabs": 1178,
    "dimension": 1179,
    "+a": 1180,
    "5x5": 1181,
    "ara": 1182,
    "arx": 1183,
    "ary": 1184,
    "y=j": 1185,
    "checkodd": 1186,
    "b=array": 1187,
    "1-b": 1188,
    "bitwise-xor": 1189,
    "ou": 1190,
    "3x3": 1191,
    "incement": 1192,
    "T=string": 1193,
    "val": 1194,
    "a=long": 1195,
    "B=array": 1196,
    "C=char": 1197,
    "sum=A": 1198,
    "+A": 1199,
    "pdd": 1200,
    "ans=array": 1201,
    "sum=input": 1202,
    "matrices": 1203,
    "|": 1204,
    ".|D|": 1205,
    ".|.|": 1206,
    "...": 1207,
    "..|": 1208,
    "23": 1209,
    "'O": 1210,
    "21": 1211,
    "outer": 1212,
    "inner": 1213,
    "O": 1214,
    "|D|": 1215,
    "|.|": 1216,
    "..|\\n": 1217,
    "|.|\\n": 1218,
    "copy": 1219,
    "zz": 1220,
    "kk": 1221,
    "numbers": 1222,
    "12": 1223,
    "single": 1224,
    "9999999999999": 1225,
    "db": 1226,
    "'|": 1227,
    "|O": 1228,
    "k2": 1229,
    "k3": 1230,
    "ost": 1231,
    "ind": 1232,
    "24": 1233,
    "followin": 1234,
    "..": 1235,
    "bus": 1236,
    "1st": 1237,
    "2nd": 1238,
    "3rd": 1239,
    "4th": 1240,
    "5th": 1241,
    "6th": 1242,
    "27": 1243,
    "ith": 1244,
    "22": 1245,
    "+\\n": 1246,
    "|O.": 1247,
    "|O.O.": 1248,
    "|O.O.O.": 1249,
    "|O.O.O.O.": 1250,
    "13": 1251,
    "14": 1252,
    "|O.O.O.O.O.": 1253,
    "15": 1254,
    "16": 1255,
    "17": 1256,
    "|O.O.O.O.O.O.": 1257,
    "18": 1258,
    "19": 1259,
    "|O.O.O.O.O.O.O.": 1260,
    "|O.O.O.O.O.O.O.O.": 1261,
    "25": 1262,
    "26": 1263,
    "|O.O.O.O.O.O.O.O.O.": 1264,
    "28": 1265,
    "29": 1266,
    "|O.O.O.O.O.O.O.O.O.O.": 1267,
    "31": 1268,
    "32": 1269,
    "|O.O.O.O.O.O.O.O.O.O.O.|D|": 1270,
    "|O.O.O.O.O.O.O.O.O.O.O.|.|": 1271,
    "34": 1272,
    "Pi": 1273,
    "arc": 1274,
    "cosine": 1275,
    "-1.0": 1276,
    "11th": 1277,
    "proceed": 1278,
    "th": 1279,
    "infinite": 1280,
    "idx": 1281,
    "4x11": 1282,
    "second": 1283,
    "move": 1284,
    "passengers": 1285,
    "ttttttttttttttttttttttttttt": 1286,
    "'+": 1287,
    "fo": 1288,
    "ri": 1289,
    "'t": 1290,
    "che": 1291,
    "acos": 1292,
    "sandali": 1293,
    "0th": 1294,
    "jth": 1295,
    "a=1": 1296,
    "3*": 1297,
    "+2": 1298,
    ".|": 1299,
    "3*a+4": 1300,
    "calc_subtractions_slow": 1301,
    "inlined": 1302,
    "numOps": 1303,
    "calc_subtractions_div": 1304,
    "calc_subtractions_mod": 1305,
    "calc_subtractions": 1306,
    "subtractions_solve": 1307,
    "numPairs": 1308,
    "cout": 1309,
    "b=int": 1310,
    "ans=0": 1311,
    "a/b": 1312,
    "a=a": 1313,
    "b/a": 1314,
    "b=b": 1315,
    "swap": 1316,
    "hasil": 1317,
    "ret": 1318,
    "tc": 1319,
    "cnt=0": 1320,
    "MAX=max": 1321,
    "MIN=min": 1322,
    "MAX": 1323,
    "MIN": 1324,
    "MAX/MIN": 1325,
    "temp=MIN": 1326,
    "MIN=MAX-MIN*": 1327,
    "MAX=temp": 1328,
    "T": 1329,
    "unsigned": 1330,
    "swp": 1331,
    "addresses": 1332,
    "test_div": 1333,
    "1000000000": 1334,
    "999999999": 1335,
    "test_mod": 1336,
    "getNumbers": 1337,
    "gotValue": 1338,
    "gotVale": 1339,
    "subtractions_solve_low": 1340,
    "istream": 1341,
    "ostream": 1342,
    "subtractions_solve_fast": 1343,
    "getline": 1344,
    "nums": 1345,
    "round": 1346,
    "1.0": 1347,
    "x/y": 1348,
    "y/x": 1349,
    "=y": 1350,
    "Q": 1351,
    "cntint": 1352,
    "cntfloat": 1353,
    "adivb": 1354,
    "bdiva": 1355,
    "total": 1356,
    "positive": 1357,
    "a/b*b": 1358,
    "b/a*a": 1359,
    "doit": 1360,
    "1ll": 1361,
    "we": 1362,
    "valid": 1363,
    "orderArguments": 1364,
    "arg1": 1365,
    "arg2": 1366,
    "subtraction": 1367,
    "areg2": 1368,
    "arg1=": 1369,
    "arg2=": 1370,
    "quotient": 1371,
    "evaluate": 1372,
    "numOfTestCases": 1373,
    "casos": 1374,
    "modu": 1375,
    "cases": 1376,
    "num1": 1377,
    "num2": 1378,
    "ops": 1379,
    "gcd": 1380,
    "getans": 1381,
    "GCD": 1382,
    "decreased": 1383,
    "10000002": 1384,
    "1000001": 1385,
    "cift": 1386,
    "tek": 1387,
    "doIt": 1388,
    "t_ab": 1389,
    "t_a": 1390,
    "t_b": 1391,
    "calling": 1392,
    "bigger": 1393,
    "lower": 1394,
    "rad": 1395,
    "smaller": 1396,
    "larger": 1397,
    "mult": 1398,
    "infinitely": 1399,
    "a=b": 1400,
    "a=0": 1401,
    "b=": 1402,
    "gcd_answ": 1403,
    "initialize": 1404,
    "settings": 1405,
    "1073741824": 1406,
    "MAX1": 1407,
    "3e8": 1408,
    "b=long": 1409,
    "x=max": 1410,
    "y=min": 1411,
    "*y": 1412,
    "m=max": 1413,
    "n=min": 1414,
    "x=m": 1415,
    "y=n": 1416,
    "B": 1417,
    "Calc": 1418,
    "0LL": 1419,
    "tc=int": 1420,
    "res=0": 1421,
    "h=b-a": 1422,
    "a-h": 1423,
    "h/a": 1424,
    "co": 1425,
    "shift": 1426,
    "places": 1427,
    "int64_t": 1428,
    "modex": 1429,
    "dv": 1430,
    "c=long": 1431,
    "r=0": 1432,
    "x=a": 1433,
    "b=x": 1434,
    "c=b/a": 1435,
    "b=b-a*c": 1436,
    "iterations": 1437,
    "noop": 1438,
    "final": 1439,
    "path": 1440,
    "txt.in": 1441,
    "txt.out": 1442,
    "fixed": 1443,
    "setprecision": 1444,
    "kq": 1445,
    "xuli": 1446,
    "_": 1447,
    "lcm": 1448,
    "retutn": 1449,
    "100005": 1450,
    "say": 1451,
    "cmd": 1452,
    "people_cnt": 1453,
    "maxs": 1454,
    "100+10": 1455,
    "unique": 1456,
    "skipping": 1457,
    "erase": 1458,
    "save": 1459,
    "position": 1460,
    "EOF": 1461,
    "1000000": 1462,
    "105": 1463,
    "byte": 1464,
    "active": 1465,
    "ineger": 1466,
    "commands": 1467,
    "person": 1468,
    "mark_idx": 1469,
    "send_size": 1470,
    "unintialized": 1471,
    "time": 1472,
    "neither": 1473,
    "colon": 1474,
    "followed": 1475,
    "1e2": 1476,
    "creatre": 1477,
    "mygets": 1478,
    "me": 1479,
    "characterfrom": 1480,
    "gets": 1481,
    "c3": 1482,
    "infinity": 1483,
    "comando": 1484,
    "ln": 1485,
    "n_participantes": 1486,
    "n_bytes": 1487,
    "n_participantes=0": 1488,
    "n_bytes=0": 1489,
    "linha_chat": 1490,
    "10005": 1491,
    "sm": 1492,
    "idx-1": 1493,
    "s.size": 1494,
    "local": 1495,
    "vis": 1496,
    "205": 1497,
    "vis.count": 1498,
    "strlen": 1499,
    "vis.size": 1500,
    "cine": 1501,
    "command": 1502,
    "id": 1503,
    "clear": 1504,
    "command.substr": 1505,
    "command.size": 1506,
    "lens": 1507,
    "frq": 1508,
    "count1": 1509,
    "store": 1510,
    "users": 1511,
    "traffic": 1512,
    "olnum": 1513,
    "charnum": 1514,
    "charsum": 1515,
    "indefinitely": 1516,
    "inpu": 1517,
    "coun": 1518,
    "count_now": 1519,
    "FindLen": 1520,
    "Set": 1521,
    "'s": 1522,
    "check1": 1523,
    "lengh": 1524,
    "txt": 1525,
    "ampty": 1526,
    "found": 1527,
    "answer": 1528,
    "100011": 1529,
    "decimal": 1530,
    "precision": 1531,
    "format": 1532,
    "cnt1": 1533,
    "cnt2": 1534,
    "tot": 1535,
    "incremen": 1536,
    "resp": 1537,
    "qClose": 1538,
    "1000000000000": 1539,
    "5001": 1540,
    "cur": 1541,
    "5050": 1542,
    "displayed": 1543,
    "utilize": 1544,
    "decimals": 1545,
    "fixed-point": 1546,
    "notation": 1547,
    "qmarks": 1548,
    "j=i": 1549,
    "1e7": 1550,
    "r-1": 1551,
    "5000": 1552,
    "fail": 1553,
    "-c": 1554,
    "j=u": 1555,
    "q+1": 1556,
    "c+q": 1557,
    "5010": 1558,
    "l=length": 1559,
    "l-1": 1560,
    "x+z": 1561,
    "y-z": 1562,
    "siz": 1563,
    "tmp2": 1564,
    "5e3": 1565,
    "dp": 1566,
    "sum1": 1567,
    "sum2": 1568,
    "sum3": 1569,
    "negative": 1570,
    "5005": 1571,
    "sup": 1572,
    "q=0": 1573,
    "3f3f3f3f": 1574,
    "exadecimal": 1575,
    "N=5050": 1576,
    "MAXN=5005": 1577,
    "vis=array": 1578,
    "s=string": 1579,
    "n=size": 1580,
    "j-i+1": 1581,
    "zuo": 1582,
    "wen": 1583,
    "que": 1584,
    "floating": 1585,
    "s=": 1586,
    "contstant": 1587,
    "recude": 1588,
    "god": 1589,
    "stirng": 1590,
    "kh": 1591,
    "zeroing": 1592,
    "them": 1593,
    "Terminate": 1594,
    "integral": 1595,
    "MAX_N": 1596,
    "1,000,000": 1597,
    "hex": 1598,
    "1e-10": 1599,
    "rt": 1600,
    "cout.precision": 1601,
    "ed": 1602,
    "f=0": 1603,
    "i=i+k": 1604,
    "f=1": 1605,
    "'G": 1606,
    "'T": 1607,
    "'A": 1608,
    "'Z": 1609,
    "initial": 1610,
    "indexT": 1611,
    "indexG": 1612,
    "size_t": 1613,
    "inreasing": 1614,
    "crate": 1615,
    "start=0": 1616,
    "len=0": 1617,
    "c=": 1618,
    "start=1": 1619,
    "n=0": 1620,
    "s=i": 1621,
    "t=i": 1622,
    "i=s": 1623,
    "i+k": 1624,
    "i-k": 1625,
    "location": 1626,
    "BFS": 1627,
    "tar": 1628,
    "subtracting": 1629,
    "loc1": 1630,
    "loc2": 1631,
    "1120": 1632,
    "x=i": 1633,
    "y=i": 1634,
    "i=y": 1635,
    "+k": 1636,
    "a=i": 1637,
    "b=i": 1638,
    "i=a": 1639,
    "loct": 1640,
    "locg": 1641,
    "rue": 1642,
    "incrment": 1643,
    "r=1": 1644,
    "No": 1645,
    "dfs": 1646,
    "g=i": 1647,
    "i=g": 1648,
    "suucessful": 1649,
    "termination": 1650,
    "diff": 1651,
    "t-10": 1652,
    "diff=1": 1653,
    "-10": 1654,
    "G'or": 1655,
    "indG": 1656,
    "indT": 1657,
    "inputs": 1658,
    "insect": 1659,
    "=a": 1660,
    "Start": 1661,
    "End": 1662,
    "i=Start": 1663,
    "l=i": 1664,
    "m=i": 1665,
    "i=l": 1666,
    "i=i-k": 1667,
    "c=c+1": 1668,
    "hap": 1669,
    "m1=map": 1670,
    "lo": 1671,
    "itr=iterator": 1672,
    "k=long": 1673,
    "pos1": 1674,
    "pos2=long": 1675,
    "pos1=i": 1676,
    "pos2=i": 1677,
    "pos2": 1678,
    "100007": 1679,
    "_s": 1680,
    "_f": 1681,
    "k=min": 1682,
    "locg-loct": 1683,
    "post": 1684,
    "s8i": 1685,
    "st=-1": 1686,
    "ed=-1": 1687,
    "st=i": 1688,
    "ed=i": 1689,
    "i=st": 1690,
    "-k": 1691,
    "ti": 1692,
    "tg": 1693,
    "space": 1694,
    "str1": 1695,
    "str2": 1696,
    "str3": 1697,
    "days": 1698,
    "nonzero": 1699,
    "strcpy": 1700,
    "n1a": 1701,
    "n2a": 1702,
    "push_back": 1703,
    "sir1": 1704,
    "sir2": 1705,
    "p=string": 1706,
    "s1=p": 1707,
    "s2=p": 1708,
    "maxN": 1709,
    "1e6": 1710,
    "1e10": 1711,
    "s=a": 1712,
    "killed": 1713,
    "added": 1714,
    "day": 1715,
    "aa=a": 1716,
    "aa=b": 1717,
    "linf": 1718,
    "62": 1719,
    "iinf": 1720,
    "dinf": 1721,
    "1e17": 1722,
    "Mod": 1723,
    "100006": 1724,
    "c=a": 1725,
    "a=d": 1726,
    "b=string": 1727,
    "y=string": 1728,
    "a=y": 1729,
    "b=y": 1730,
    "=d": 1731,
    "readind": 1732,
    "rep": 1733,
    "kill": 1734,
    "na1": 1735,
    "na2": 1736,
    "n1=": 1737,
    "str4": 1738,
    "=integer": 1739,
    "compare": 1740,
    "copies": 1741,
    "pointed": 1742,
    "MAX2": 1743,
    "eps": 1744,
    "pot1": 1745,
    "pot2": 1746,
    "crete": 1747,
    "vict": 1748,
    "ele": 1749,
    "bal": 1750,
    "counts": 1751,
    "1e-8": 1752,
    "pod": 1753,
    "pod1": 1754,
    "res_arr": 1755,
    "to_be_replaced": 1756,
    "replaced_by": 1757,
    "name1": 1758,
    "name2": 1759,
    "temp1": 1760,
    "temp2": 1761,
    "1024": 1762,
    ".first": 1763,
    ".second": 1764,
    "=B": 1765,
    "=b": 1766,
    "=A": 1767,
    "af": 1768,
    "nex": 1769,
    "ft": 1770,
    "q.count": 1771,
    "s1.compare": 1772,
    "a=s": 1773,
    "s=b": 1774,
    "a0": 1775,
    "b0": 1776,
    "replacement": 1777,
    "a+y": 1778,
    "b+y": 1779,
    "death": 1780,
    "s3=s1": 1781,
    "setIO": 1782,
    "same": 1783,
    "b1": 1784,
    "vs": 1785,
    "Time": 1786,
    "elapsed": 1787,
    "clock": 1788,
    "CLOCKS_PER_SEC": 1789,
    "s.\\n": 1790,
    "digits": 1791,
    "ticks": 1792,
    "fir": 1793,
    "prevc": 1794,
    "prevr": 1795,
    "ls": 1796,
    "nx": 1797,
    "ff": 1798,
    "used": 1799,
    "iso": 1800,
    "chrColor": 1801,
    "color": 1802,
    "perColor": 1803,
    "perRowColor": 1804,
    "SIZE": 1805,
    "shorts": 1806,
    "anomalyFound": 1807,
    "matriz": 1808,
    "suma": 1809,
    "prom": 1810,
    "pass": 1811,
    "k+1": 1812,
    "'x": 1813,
    "tmp1": 1814,
    "tmp3": 1815,
    "isRow": 1816,
    "last_stripe": 1817,
    "current_stripe": 1818,
    "stripe": 1819,
    "str.find_first_not_of": 1820,
    ":npos": 1821,
    "fre": 1822,
    "2005": 1823,
    "m-2": 1824,
    "does": 1825,
    "n-2": 1826,
    "Print": 1827,
    "stderr": 1828,
    "prev": 1829,
    "'z": 1830,
    "func": 1831,
    "goto": 1832,
    "b=true": 1833,
    "upLetter": 1834,
    "letter": 1835,
    "downLetter": 1836,
    "palindrom": 1837,
    "begin": 1838,
    "numW": 1839,
    "numL": 1840,
    "word": 1841,
    "readn": 1842,
    "200007": 1843,
    "num/2": 1844,
    "j=n-1": 1845,
    "cmp": 1846,
    "ch2-": 1847,
    "chk": 1848,
    "untile": 1849,
    "-w": 1850,
    "1-": 1851,
    "998244353": 1852,
    "ONLINE__JUDGE": 1853,
    "ac": 1854,
    "lss": 1855,
    "act": 1856,
    "reverse": 1857,
    "s2.begin": 1858,
    "s2.end": 1859,
    "s1.size": 1860,
    "setf": 1861,
    "mi": 1862,
    "-1e9": 1863,
    "1002": 1864,
    "m/2": 1865,
    "inclsuive": 1866,
    "k=0": 1867,
    "m-i-1": 1868,
    "-s": 1869,
    "_=": 1870,
    "isP": 1871,
    "s.at": 1872,
    "v4": 1873,
    "can_change": 1874,
    "t=int": 1875,
    "n-1-i": 1876,
    "-2": 1877,
    "k=x-1": 1878,
    "lo++": 1879,
    "semicolumn": 1880,
    "T=int": 1881,
    "S=string": 1882,
    "ac=true": 1883,
    "t1=S": 1884,
    "-97": 1885,
    "t2=S": 1886,
    "t1-t2": 1887,
    "ac=false": 1888,
    "qpow": 1889,
    "again": 1890,
    "inve": 1891,
    "pri_num": 1892,
    "palin": 1893,
    "there": 1894,
    "g1": 1895,
    "YES|n": 1896,
    "palindrome": 1897,
    "modPow": 1898,
    "nCr": 1899,
    "Sieve": 1900,
    "1000009": 1901,
    "1000006": 1902,
    "factorial": 1903,
    "catalan": 1904,
    "isCheck": 1905,
    "a+1": 1906,
    "b+1": 1907,
    "str=string": 1908,
    "tam=int": 1909,
    "teste": 1910,
    "tam": 1911,
    "i=int": 1912,
    "lim=tam/2": 1913,
    "lim": 1914,
    "-str": 1915,
    "tam-i": 1916,
    "ncasos=int": 1917,
    "ncasos": 1918,
    "proverka": 1919,
    "othewise": 1920,
    "57": 1921,
    "*pre": 1922,
    "*end": 1923,
    "check_palindrome": 1924,
    "b2": 1925,
    "'b": 1926,
    "'y": 1927,
    "alphabetic": 1928,
    "order": 1929,
    "previous": 1930,
    "before": 1931,
    "code": 1932,
    "lines": 1933,
    "candidate": 1934,
    "votes": 1935,
    "cond": 1936,
    "Max": 1937,
    "-9999999": 1938,
    "ending": 1939,
    "INFF": 1940,
    "1000000000000000005LL": 1941,
    "priority_queue": 1942,
    "liz": 1943,
    "top": 1944,
    "pop": 1945,
    "ncandidates": 1946,
    "nvotes": 1947,
    "changedVotes": 1948,
    "bestIndex": 1949,
    "bestVotes": 1950,
    "least": 1951,
    "leave": 1952,
    "a*b/gcd": 1953,
    "pq": 1954,
    "priority": 1955,
    "queue": 1956,
    "counts=0": 1957,
    "a+2": 1958,
    "a+n+1": 1959,
    "-10000": 1960,
    "forward": 1961,
    "front": 1962,
    "biggest": 1963,
    "pq.empty": 1964,
    "pq.top": 1965,
    "g=0": 1966,
    "highnum=0": 1967,
    "highid=-1": 1968,
    "highnum": 1969,
    "highid=y": 1970,
    "highid": 1971,
    "g=1": 1972,
    "log": 1973,
    "points": 1974,
    "allocate": 1975,
    "block": 1976,
    "memory": 1977,
    "smallest": 1978,
    "largest": 1979,
    "runs": 1980,
    "elemetns": 1981,
    "loops": 1982,
    "ascending": 1983,
    "forever": 1984,
    "107": 1985,
    "i=2": 1986,
    "p=a": 1987,
    "vote": 1988,
    "most": 1989,
    "max_element": 1990,
    "cnt++": 1991,
    "choc": 1992,
    "voters": 1993,
    "maxv": 1994,
    "loc": 1995,
    "having": 1996,
    "form": 1997,
    "l=": 1998,
    "arr+1": 1999,
    "arr+n": 2000,
    "font": 2001,
    "-ans": 2002,
    "comp": 2003,
    "fl": 2004,
    "my": 2005,
    "voters.top": 2006,
    "modn": 2007,
    "p.top": 2008,
    "dq": 2009,
    "greatest": 2010,
    "q=priority_queue": 2011,
    "temp=0": 2012,
    "t=first": 2013,
    "item": 2014,
    "f1": 2015,
    "TRIANGLE": 2016,
    "SEGMENT": 2017,
    "IMPOSSIBLE": 2018,
    "interchange": 2019,
    "xx+4": 2020,
    "b=0": 2021,
    "b++": 2022,
    "valuef": 2023,
    "IMPOSSIBLE\\n": 2024,
    "SEGMENT\\n": 2025,
    "TRIANGLE\\n": 2026,
    "terminate": 2027,
    "a+4": 2028,
    "OR|": 2029,
    "'TRIANGLE": 2030,
    "arr=": 2031,
    "arr+4": 2032,
    "+v": 2033,
    "best": 2034,
    "best=integer": 2035,
    "v=": 2036,
    "par": 2037,
    "'IMPOSSIBLE": 2038,
    "checkDegenerate": 2039,
    "exchange": 2040,
    "seg": 2041,
    "normal": 2042,
    "deg": 2043,
    "b+c": 2044,
    "constants": 2045,
    "tri": 2046,
    "reopen": 2047,
    "debug.txt": 2048,
    "equ": 2049,
    "|=": 2050,
    "1,2,3,4": 2051,
    "continuing": 2052,
    "j'th": 2053,
    "i'th": 2054,
    "k'th": 2055,
    "triangle": 2056,
    "segment": 2057,
    "stat": 2058,
    "match": 2059,
    "base": 2060,
    "arrr2": 2061,
    "pad": 2062,
    "5e5": 2063,
    "mt": 2064,
    "pow": 2065,
    "s.length": 2066,
    "s.find": 2067,
    "s.substr": 2068,
    "fast_exp": 2069,
    "non": 2070,
    "theen": 2071,
    "res*base": 2072,
    "base^2": 2073,
    "re": 2074,
    "longn": 2075,
    "mg": 2076,
    "conv": 2077,
    "ChuyenDoi": 2078,
    "000000000000000000": 2079,
    "flat": 2080,
    "=char": 2081,
    "524289": 2082,
    "tran": 2083,
    "biao": 2084,
    "op": 2085,
    "resulf": 2086,
    "alter": 2087,
    "x.size": 2088,
    "dig": 2089,
    "cnt.find": 2090,
    "cnt.end": 2091,
    "tipo": 2092,
    "usa": 2093,
    "us": 2094,
    "inter": 2095,
    "poss": 2096,
    "x=": 2097,
    "siz=": 2098,
    "-siz": 2099,
    "s2+s1": 2100,
    "ope": 2101,
    "bi": 2102,
    "query": 2103,
    "place": 2104,
    "num.size": 2105,
    "cast": 2106,
    "tobin": 2107,
    "constance": 2108,
    "1000*1000*1000": 2109,
    "var": 2110,
    "prepend": 2111,
    "maxm": 2112,
    "mp1": 2113,
    "mp2": 2114,
    "getsolved": 2115,
    "alpha": 2116,
    "mymap": 2117,
    "reads": 2118,
    "delete": 2119,
    "mymap=map": 2120,
    "sum=0": 2121,
    "ch=char": 2122,
    "base=0": 2123,
    "remains": 2124,
    "i=length": 2125,
    "k=s": 2126,
    "-'0": 2127,
    "res.find_first_not_of": 2128,
    "res.substr": 2129,
    "pot": 2130,
    "s=+": 2131,
    "num=0": 2132,
    "+pot": 2133,
    "pot*10": 2134,
    "aux/10": 2135,
    "IntToPattern": 2136,
    "patt": 2137,
    "nl": 2138,
    "el": 2139,
    "sl": 2140,
    "Cnt": 2141,
    "msk": 2142,
    "x+k": 2143,
    "k*2": 2144,
    "c=+": 2145,
    "c=-": 2146,
    "ch=+": 2147,
    "cn": 2148,
    "p=": 2149,
    "x/10": 2150,
    "a/__gcd": 2151,
    "*b": 2152,
    "dX": 2153,
    "dY": 2154,
    "map1": 2155,
    "lens-i": 2156,
    "newlien": 2157,
    "get_str": 2158,
    "n=num": 2159,
    "mp=map": 2160,
    "num=long": 2161,
    "sp=string": 2162,
    "sp": 2163,
    "str=get_str": 2164,
    "mcnt=0": 2165,
    "lead=0": 2166,
    "s=substring": 2167,
    "sp-cnt": 2168,
    "mcnt": 2169,
    "'S": 2170,
    "rr": 2171,
    "cc": 2172,
    "put": 2173,
    "row=array": 2174,
    "Create": 2175,
    "execute": 2176,
    "cakes=0": 2177,
    "==0": 2178,
    "cakes": 2179,
    "bools": 2180,
    "default": 2181,
    "cols": 2182,
    "respectively": 2183,
    "r=": 2184,
    "j=": 2185,
    "eaten": 2186,
    "Input": 2187,
    "Solve": 2188,
    "hor": 2189,
    "ver": 2190,
    "sets": 2191,
    "cake": 2192,
    "noteaten_r": 2193,
    "noteaten_c": 2194,
    "freq": 2195,
    "freq1": 2196,
    "zeroes": 2197,
    "i-cnt": 2198,
    "chn": 2199,
    "chm": 2200,
    "ans=integer": 2201,
    "s2.size": 2202,
    "ro": 2203,
    "'n": 2204,
    "rowsDeleted": 2205,
    "**inputArr": 2206,
    "*rows": 2207,
    "*cols": 2208,
    "inputArr": 2209,
    "lenght": 2210,
    "rowCount": 2211,
    "colCount": 2212,
    "prunt": 2213,
    "rb": 2214,
    "cb": 2215,
    "lenghts": 2216,
    "cont2": 2217,
    "aux1": 2218,
    "aux2": 2219,
    "cont=0": 2220,
    "cont2=0": 2221,
    "aux1=0": 2222,
    "aux2=0": 2223,
    "@": 2224,
    "trans": 2225,
    "onf": 2226,
    "rowSet": 2227,
    "colSet": 2228,
    "eatable": 2229,
    "purple": 2230,
    "Power": 2231,
    "green": 2232,
    "blue": 2233,
    "Space": 2234,
    "orange": 2235,
    "Soul": 2236,
    "red": 2237,
    "Reality": 2238,
    "yellow": 2239,
    "Mind": 2240,
    "00": 2241,
    "names": 2242,
    "need": 2243,
    "null": 2244,
    "maxn=100010": 2245,
    "'p": 2246,
    "'g": 2247,
    "'o": 2248,
    "'r": 2249,
    "ignore": 2250,
    "comparison": 2251,
    "Power\\nTime\\nSpace\\nSoul\\nReality\\nMind\\n": 2252,
    "rfind": 2253,
    "x5": 2254,
    "x6": 2255,
    "output=array": 2256,
    "temp=string": 2257,
    "out=array": 2258,
    "=false": 2259,
    "t=0": 2260,
    "rean": 2261,
    "vvod": 2262,
    "reshala": 2263,
    "gol": 2264,
    "kachok": 2265,
    "y=": 2266,
    "nome": 2267,
    "0s": 2268,
    "mas": 2269,
    "mas1": 2270,
    "inclusve": 2271,
    "Names": 2272,
    "DeleteIt": 2273,
    "replace": 2274,
    "Colours": 2275,
    "s_color": 2276,
    "s_ip": 2277,
    "si": 2278,
    "k=array": 2279,
    "vet": 2280,
    "Power\\n": 2281,
    "Time\\n": 2282,
    "Space\\n": 2283,
    "Soul\\n": 2284,
    "Reality\\n": 2285,
    "Mind\\n": 2286,
    "puno": 2287,
    "nula": 2288,
    "nope": 2289,
    "GetStone": 2290,
    "FindNotFound": 2291,
    "stone": 2292,
    "stones": 2293,
    "ret=false": 2294,
    "ret=true": 2295,
    "stones=vector": 2296,
    "st=vector": 2297,
    "not_found=vector": 2298,
    "not_found": 2299,
    "gem": 2300,
    "have": 2301,
    "mass": 2302,
    "6-n": 2303,
    "ans1": 2304,
    "ans2": 2305,
    "ans3": 2306,
    "ans4": 2307,
    "ans5": 2308,
    "ans6": 2309,
    "sir": 2310,
    "colors": 2311,
    "strcmp": 2312,
    "gems": 2313,
    "iterating": 2314,
    "^": 2315,
    "-x": 2316,
    "exclusivev": 2317,
    "101-element": 2318,
    "signal": 2319,
    "postdecremented": 2320,
    "vis=false": 2321,
    "vis=true": 2322,
    "bt": 2323,
    "bohlam": 2324,
    "list": 2325,
    "duplicate": 2326,
    "consecutive": 2327,
    "150": 2328,
    "blag": 2329,
    "1,000-element": 2330,
    "Boolean": 2331,
    "cek": 2332,
    "INF_INT": 2333,
    "2147483647": 2334,
    "INF_LL": 2335,
    "9223372036854775807LL": 2336,
    "INF_ULL": 2337,
    "18446744073709551615Ull": 2338,
    "P": 2339,
    "92540646808111039LL": 2340,
    "Move": 2341,
    "Move_": 2342,
    "lasagna": 2343,
    "696969": 2344,
    "cyka": 2345,
    "blyat": 2346,
    "A=0": 2347,
    "p=set": 2348,
    "a=int": 2349,
    "l=int": 2350,
    "l=size": 2351,
    "buttons": 2352,
    "bulbs": 2353,
    "marks": 2354,
    "connected": 2355,
    "bulb_no": 2356,
    "is_possible": 2357,
    "ccreate": 2358,
    "inserting": 2359,
    "sizeofb": 2360,
    "105-elt": 2361,
    "bulb": 2362,
    "towhid": 2363,
    "towhid.size": 2364,
    "tail": 2365,
    "F": 2366,
    "removeDuplicates": 2367,
    "j++": 2368,
    "bul": 2369,
    "sizebul": 2370,
    "LIM": 2371,
    "nb": 2372,
    "nbulb": 2373,
    "qt": 2374,
    "20001": 2375,
    "An": 2376,
    "m-element": 2377,
    "turned": 2378,
    "contain": 2379,
    "10^9+7": 2380,
    "res*x": 2381,
    "x*x": 2382,
    "esclusive": 2383,
    "g=int": 2384,
    "g-1": 2385,
    "done=true": 2386,
    "asc": 2387,
    "t/": 2388,
    "dt": 2389,
    "nr": 2390,
    "Control": 2391,
    "jumps": 2392,
    "curlower": 2393,
    "NeedTime": 2394,
    "t=": 2395,
    "tim": 2396,
    "tim=tim+": 2397,
    "2*m-2": 2398,
    "tim=": 2399,
    "seed": 2400,
    "131": 2401,
    "1200": 2402,
    "fi": 2403,
    "gotodown": 2404,
    "gotoup": 2405,
    "moves": 2406,
    "piso": 2407,
    "dist": 2408,
    "2*": 2409,
    "M-1": 2410,
    "ts": 2411,
    "xxx": 2412,
    "ud": 2413,
    "control": 2414,
    "ax": 2415,
    "l/2": 2416,
    "work": 2417,
    "0if": 2418,
    "ans=": 2419,
    "over": 2420,
    "timr": 2421,
    "max3": 2422,
    "adji": 2423,
    "adjo": 2424,
    "10000000000": 2425,
    "dif": 2426,
    "-=": 2427,
    "-f": 2428,
    "u_d": 2429,
    "d_u": 2430,
    "nap": 2431,
    "et": 2432,
    "t/m": 2433,
    "t/m+1": 2434,
    "tem": 2435,
    "temp=": 2436,
    "s-": 2437,
    "integerss": 2438,
    "tm": 2439,
    "ttt": 2440,
    "0x3FFFFFFF": 2441,
    "lca": 2442,
    "lcu": 2443,
    "peso": 2444,
    "contains": 2445,
    "LCA": 2446,
    "v/2": 2447,
    "u/2": 2448,
    "3e5": 2449,
    "log2": 2450,
    "cal": 2451,
    "parent": 2452,
    "route": 2453,
    "pu": 2454,
    "mxcommon": 2455,
    "rta": 2456,
    "cost": 2457,
    "131071": 2458,
    "sel": 2459,
    "depth": 2460,
    "dep_u": 2461,
    "dep_v": 2462,
    "A.find": 2463,
    "A.end": 2464,
    "decrementim": 2465,
    "temp0": 2466,
    "getPr": 2467,
    "getAns": 2468,
    "finish": 2469,
    "setTree": 2470,
    "send": 2471,
    "cost=map": 2472,
    "poskupi": 2473,
    "cena": 2474,
    "q=int": 2475,
    "w=long": 2476,
    "v=long": 2477,
    "q-1": 2478,
    "e=long": 2479,
    "lol=pair": 2480,
    "signature": 2481,
    "finder": 2482,
    "q=b": 2483,
    "x=lca": 2484,
    "log_=1": 2485,
    "y=log2": 2486,
    "x=log2": 2487,
    "2^log_": 2488,
    "log_": 2489,
    "i=log_": 2490,
    "y-2^": 2491,
    "substract": 2492,
    "2^": 2493,
    "p/2": 2494,
    "q/2": 2495,
    "e=a": 2496,
    "lol=e": 2497,
    "lol=a": 2498,
    "=z": 2499,
    "e=b": 2500,
    "lol=b": 2501,
    "dis": 2502,
    "anc": 2503,
    "qq": 2504,
    "inteiger": 2505,
    "tht": 2506,
    "p.find": 2507,
    "p.end": 2508,
    "dfs2": 2509,
    "tree": 2510,
    "add_path": 2511,
    "wh": 2512,
    "max1": 2513,
    "++freq": 2514,
    "pnt": 2515,
    "comparator": 2516,
    "brr": 2517,
    "500000": 2518,
    "it-": 2519,
    "main_str": 2520,
    "start_index": 2521,
    "str_for_compare": 2522,
    "reg": 2523,
    "occ": 2524,
    "ks": 2525,
    "-1000000007": 2526,
    "index1": 2527,
    "index2": 2528,
    "tmp_ans": 2529,
    "cent": 2530,
    "present": 2531,
    "a=string": 2532,
    "max=0": 2533,
    "j=i+1": 2534,
    "m=0": 2535,
    "i+m": 2536,
    "j+m": 2537,
    "max=m": 2538,
    "record": 2539,
    "intege": 2540,
    "str.size": 2541,
    "sub": 2542,
    "str.substr": 2543,
    "str.find": 2544,
    "sub.length": 2545,
    "all.size": 2546,
    "all=set": 2547,
    "i=size": 2548,
    "s-1": 2549,
    "s-i": 2550,
    "inserti": 2551,
    "s-i+1": 2552,
    "elseif": 2553,
    "v-1": 2554,
    "=k": 2555,
    "j=i-1": 2556,
    "fpr": 2557,
    "opposite": 2558,
    "forth": 2559,
    "deque": 2560,
    "deq": 2561,
    "countl": 2562,
    "countr": 2563,
    "V": 2564,
    "Bn": 2565,
    "preorder": 2566,
    "rearorder": 2567,
    "i=n": 2568,
    "bf": 2569,
    "l=false": 2570,
    "cou": 2571,
    "1e8": 2572,
    "ct": 2573,
    "marked": 2574,
    "seen=array": 2575,
    "K=int": 2576,
    "answer=0": 2577,
    "seen": 2578,
    "i=N-1": 2579,
    "head": 2580,
    "N=1000006": 2581,
    "inf=1000000007": 2582,
    "Arr=array": 2583,
    "n+2": 2584,
    "Arr": 2585,
    "lft=1": 2586,
    "lft": 2587,
    "rgt=n": 2588,
    "rgt": 2589,
    "manx": 2590,
    "remove_zeros": 2591,
    "ten": 2592,
    "bx": 2593,
    "cry": 2594,
    "a.size": 2595,
    "b.size": 2596,
    "ta": 2597,
    "tb": 2598,
    "ans.size": 2599,
    "era": 2600,
    "p.size": 2601,
    "srings": 2602,
    "a.begin": 2603,
    "a.end": 2604,
    "b.begin": 2605,
    "b.end": 2606,
    "a_": 2607,
    "b_": 2608,
    "c_": 2609,
    "remove_zero": 2610,
    "lzl": 2611,
    "x=1": 2612,
    "z++": 2613,
    "zeroRemover": 2614,
    "remove0": 2615,
    "gum": 2616,
    "10^k": 2617,
    "320": 2618,
    "n/10": 2619,
    "d*pow": 2620,
    "a+b": 2621,
    "A+B": 2622,
    "zx": 2623,
    "removeZeros": 2624,
    "tempa": 2625,
    "tempb": 2626,
    "rem1": 2627,
    "newa": 2628,
    "newb": 2629,
    "newsum": 2630,
    "putchar": 2631,
    "remv": 2632,
    "div": 2633,
    "static": 2634,
    "ostringstream": 2635,
    "getNum": 2636,
    "currMod": 2637,
    "zy": 2638,
    "removeZero": 2639,
    "takeing": 2640,
    "0.01": 2641,
    "three": 2642,
    "bit-wise": 2643,
    "returnr": 2644,
    "es": 2645,
    "ad": 2646,
    "cd": 2647,
    "bg": 2648,
    "cs": 2649,
    "multiplier": 2650,
    "bd": 2651,
    "darVuelta": 2652,
    "dig1": 2653,
    "quitarZeros": 2654,
    "sum1_str": 2655,
    "sum2_str": 2656,
    "string_int": 2657,
    "int_string": 2658,
    "ta+tb+cry": 2659,
    "p/10": 2660,
    "a1/10": 2661,
    "mul1": 2662,
    "mul2": 2663,
    "v/10": 2664,
    "/10": 2665,
    "y-1": 2666,
    "converted": 2667,
    "ss.str": 2668,
    "ss1": 2669,
    "anew": 2670,
    "ss2": 2671,
    "bnew": 2672,
    "ss3": 2673,
    "cnew": 2674,
    "matching": 2675,
    "removed": 2676,
    "stringstream": 2677,
    "geek": 2678,
    "geek1": 2679,
    "geek2": 2680,
    "gcd1": 2681,
    "modx": 2682,
    "1000000009LL": 2683,
    "ans2=": 2684,
    "adj": 2685,
    "pt": 2686,
    "en": 2687,
